W6D2/FirstRoutes/app/controllers/users_controller.rb

    def create
        # user = User.new(params.require(:user).permit(:name, :email))
        user = User.new(user_columns)
        if user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Carlos"], ["created_at", "2020-12-29 23:28:47.733056"], ["updated_at", "2020-12-29 23:28:47.733056"]]

    def destroy
        user_new =  User.delete(params[:id])
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]