W6D3/ArtShare/app/controllers/users_controller.rb

    def index
      if params[:query]
        users = User.where('username LIKE ?', "%#{params[:query]}%")
      else
        users = User.all
---
SELECT "users".* FROM "users"